// ********************************************************************************************************************
// *                     Общие установки для процессов, выполняющихся непосредственно на борту.                       *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       created 21 apr 2017 at 18:09 *
// ********************************************************************************************************************

#pragma once

#include <QSettings>

// Чтобы не перекрывать класс QSettings ради только одного конструктора, на все программы onboard
// сделан макрос. Так гарантированно будет - и одно и то же имя, и один и тот же формат установочного
// файла.

#define CREATE_SETTINGS_ONBOARD       QSettings settings_onboard("/etc/tengu/onboard.conf", QSettings::IniFormat)
    
