// ********************************************************************************************************************
// *                                                                                                                  *
// *               Some variables are defined through two arrays at the same time (simultaneously).                   *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                       Некоторые переменные определяются через два массива одновременно.                          *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 10 may 2017 at 13:20 *
// ********************************************************************************************************************

#include "XChFloatArrayTwice.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                 The constructor.                                                 *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                    Конструктор.                                                  *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::XChFloatArrayTwice::XChFloatArrayTwice ( QString aName, QString path, int aMinValue, int aMaxValue ) 
    : XChFloatArray ( aName, path, aMinValue, aMaxValue )
    , _dataref_1( nullptr )
    , _dataref_2( nullptr )
    , _template_1( QList<int>() )
    , _template_2( QList<int>() )
    
{
    
    for ( int i=0; i<XPLANE_SURFACES_COUNT; i++ ) {
        _template_1.append( 0 );
        _template_2.append( 0 );
    };

}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                       Overrided method for setting integer value.                                *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                      Перекрытый метод установки целого значения.                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::XChFloatArrayTwice::set ( int value ) {
    this->set( ( float ) value );
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                    Overrided method for setting float value.                                     *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                              Перекрытый метод для установки вещественного значения.                              *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::XChFloatArrayTwice::set ( float value ) {
        
    if ( _dataref_1 ) {
        
        _dataref = _dataref_1;
        _templateArray = _template_1;        
        XChFloatArray::set( value );
        
    };
    
    if ( _dataref_2 ) {
        
        _dataref = _dataref_2;
        _templateArray = _template_2;
        XChFloatArray::set( value );
        
    };
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                         Overrided usable determitation method.                                   *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                         Перекрытый метод для определения пригодности канала к использованию.                     *
// *                                                                                                                  *
// ********************************************************************************************************************

bool tengu::XChFloatArrayTwice::usable() {
    
    // For a twice array, it will be sufficient if there is at least one of the data pointers.
    // Для двойного массива будет достаточно, если существует хотя бы один из указателей данных.
    
    return ( ( _dataref_1 != nullptr ) || ( _dataref_2 != nullptr ) );
    
}


// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                  The destructor.                                                 *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                     Деструктор.                                                  *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::XChFloatArrayTwice::~XChFloatArrayTwice() {

}

