// ********************************************************************************************************************
// *                                                                                                                  *
// *                                     The common constants for all GUI-based programs.                             *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                       Общие константы для всех графических программ.                             *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 01 jun 2017 at 10:28 *
// ********************************************************************************************************************


#pragma once

#define SPLITTERS_HANDLE_WIDTH 3
#define SPLITTERS_LINE_WIDTH 2
