// ********************************************************************************************************************
// *                                                                                                                  *
// *                          QGraphicsScene adopted for AbstractAgent and his descedants.                            *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                      QGraphicsScene, адаптированная для абстрактного агента и его потомков.                      *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 10 jun 2017 at 11:11 *
// ********************************************************************************************************************

#include "SchemaScene.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The constructor.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                     Конструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::SchemaScene::SchemaScene ( QObject* parent ) 
    : QGraphicsScene ( parent )
{
    __rootItem = nullptr;
    __changed = false;
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                           Unselect all of existing elements.                                     *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                  Отменить выбранность у всех существующих элементов.                             *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::SchemaScene::unselectAll() {
    
    QList < QGraphicsItem * > allItems = items();
    for ( int i=0; i<allItems.size(); i++ ) {
        AbstractEntityItem * agentItem = ( AbstractEntityItem * ) allItems.at(i);
        if ( agentItem ) {
            if ( agentItem->isSelected() ) {
                agentItem->setSelected( false );
            }
        };
    };
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                            Set root entity item for scene.                                       *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                         Установить корневой элемент для сцены.                                   *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::SchemaScene::setRootItem ( tengu::AbstractEntityItem * rootItem ) {
    
    if ( __rootItem ) {
        delete( __rootItem );
        __rootItem = nullptr;
    };
    
    __rootItem = rootItem;        
    clear();
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                            Has something been changed?                                           *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                              Менялось ли что-нибудь?                                             *
// *                                                                                                                  *
// ********************************************************************************************************************

bool tengu::SchemaScene::changed() {
    return __changed;
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                              Overrided add item method.                                          *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                         Перекрытый метод добавления элемента.                                    *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::SchemaScene::addItem ( tengu::AbstractEntityItem * item ) {
    
    // This is in any case.
    // Это - в любом случае.
    
    QGraphicsScene::addItem( item );
    QObject::connect( item, SIGNAL( signalSomethingChanged() ), this, SLOT( __on__something_changed() ) );
    
    // Add an X-Plane agent does not come to changes.
    // Добавление X-Plane агента - не приводит к изменениям.
    
    XPlaneAgentItem * xp = dynamic_cast<XPlaneAgentItem * >(item);
    if ( ! xp ) __on__something_changed();
    
    // If this is a link, it can be in "semi-added" state.
    // Если это связь, то она может находиться в "полу-добавленном" состоянии.
    
    LinkItem * link = dynamic_cast<LinkItem *>( item );
    if ( link ) {
        
    };
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                     Remove links that were not completely created.                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                 Удаление связей, которые были созданы не полностью.                              *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::SchemaScene::removeSemiCreatedLinks() {
    
    QList<QGraphicsItem * > items = this->items();
    bool deleted = true;
    while ( deleted ) {
        
        deleted = false;
        for ( int i=0; i<items.count(); i++ ) {
            
            LinkItem * link = dynamic_cast<LinkItem *>( items.at(i) );
            if ( ( link ) && ( ( link->semiCreated() ) || ( link->isEmpty() ) ) ) {
                
                deleted = true;
                delete( link );
                link = nullptr;
                items.removeAt( i );
                break;
                
            };
        };
        
    };
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                              Something has been changed.                                         *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                Что-то было изменено.                                             *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::SchemaScene::__on__something_changed() {
    
    __changed = true;
    emit signalSomethingChanged();
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The destructor.                                                *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Деструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::SchemaScene::~SchemaScene() {
    
    if ( __rootItem ) {
        delete( __rootItem );
        __rootItem = nullptr;
    };
    
}

