// ********************************************************************************************************************
// *                                                                                                                  *
// *                                       Task QML editor with syntax highlight.                                     *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                    Редактор QMLя задачи с подсветкой синтаксиса.                                 *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 26 jul 2017 at 11:14 *
// ********************************************************************************************************************

#include "DialogPropertiesTask_TabQML.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                The constructor.                                                  *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                  Конструктор.                                                    *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::DialogPropertiesTask_TabQML::DialogPropertiesTask_TabQML ( QWidget* parent, Qt::WindowFlags f ) 
    : QFrame ( parent, f ) 
{
    QHBoxLayout * lay = new QHBoxLayout();
    lay->setMargin( 5 );
    lay->setSpacing( 5 );
    lay->setAlignment( Qt::AlignCenter );
    setLayout( lay );
    
    __textEditor = new QTextEdit();
    lay->addWidget( __textEditor );
    
    __highlighter = new QMLHighlighter( __textEditor->document() );
    
    QFont font;    
    font.setFamily("DejaVu Sans Mono");    
    // font.setFamily("Courier");
    font.setFixedPitch(true);
    font.setPointSize( 10 );
    __textEditor->setFont( font );
    
    __qmlEngine = new QQmlEngine( this );
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                   Fill the QML-editor from agent (from task).                                    *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                  Заполнить редактор QMLя из агента (из задачи)                                   *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::DialogPropertiesTask_TabQML::fillFrom ( tengu::Task * task ) {
    if ( task ) {
        __textEditor->setPlainText( task->qml() );
    };
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                       Set the task fields from the dialog.                                       *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                        Установить поля задачи из диалога.                                        *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::DialogPropertiesTask_TabQML::fillTo ( tengu::Task * task ) {
    
    if ( task ) {
        task->setQml( __textEditor->toPlainText() );
    };
    
}


// ********************************************************************************************************************
// *                                                                                                                  *
// *                                               The destructor.                                                    *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                  Деструктор.                                                     *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::DialogPropertiesTask_TabQML::~DialogPropertiesTask_TabQML() {
    
    __qmlEngine->collectGarbage();
    delete( __qmlEngine );    
    __qmlEngine = nullptr;
    
}



