// ********************************************************************************************************************
// *                                                                                                                  *
// *                                 The tab with condition for starting of the task.                                 *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                   Вкладка табулятора с условием старта задачи.                                   *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 25 jul 2017 at 12:12 *
// ********************************************************************************************************************

#include "DialogPropertiesTask_TabStartCondition.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                The constructor.                                                  *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                   Конструктор.                                                   *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::DialogPropertiesTask_TabStartCondition::DialogPropertiesTask_TabStartCondition() 
    : QFrame() 
{

    // setFrameStyle( QFrame::StyledPanel | QFrame::Sunken );
    
    QHBoxLayout * lay = new QHBoxLayout();
    lay->setMargin( 5 );
    lay->setSpacing( 5 );
    lay->setAlignment( Qt::AlignCenter );
    setLayout( lay );
    
    start_condition = new QTextEdit();
    lay->addWidget( start_condition );
    
};

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                  The destructor.                                                 *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                     Деструктор.                                                  *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::DialogPropertiesTask_TabStartCondition::~DialogPropertiesTask_TabStartCondition() {
}
