// ********************************************************************************************************************
// *                                                                                                                  *
// *                                   The tab with condition for stop of the task.                                   *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                              Вкладка табулятора, содержащая условие остановки задачи.                            * 
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 25 jul 2017 at 12:17 *
// ********************************************************************************************************************

#include "DialogPropertiesTask_TabStopCondition.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The constructor.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Конструктор.                                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::DialogPropertiesTask_TabStopCondition::DialogPropertiesTask_TabStopCondition()
    : QFrame()
{

    // setFrameStyle( QFrame::StyledPanel | QFrame::Sunken );
    
    QHBoxLayout * lay = new QHBoxLayout();
    lay->setMargin( 5 );
    lay->setSpacing( 5 );
    lay->setAlignment( Qt::AlignCenter );
    setLayout( lay );
    
    stop_condition = new QTextEdit();
    lay->addWidget( stop_condition );
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                    The destructor.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                       Деструктор.                                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::DialogPropertiesTask_TabStopCondition::~DialogPropertiesTask_TabStopCondition() {
}

