// ********************************************************************************************************************
// *                                                                                                                  *
// *                                       Tab widget containing task algorythm.                                      *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                  Вкладка табулятора, содержащая алгоритм задачи.                                 *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 25 jul 2017 at 12:07 *
// ********************************************************************************************************************

#include "DialogPropertiesTask_TabAlgorythm.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                  The constructor.                                                *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                     Конструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::DialogPropertiesTask_TabAlgorythm::DialogPropertiesTask_TabAlgorythm() 
    : QFrame()
{
    // setFrameStyle( QFrame::StyledPanel | QFrame::Sunken );
    
    QHBoxLayout * lay = new QHBoxLayout();
    lay->setMargin( 5 );
    lay->setSpacing( 5 );
    lay->setAlignment( Qt::AlignCenter );
    setLayout( lay );
    
    algorythm = new QTextEdit();
    lay->addWidget( algorythm );
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The destructor.                                                *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Деструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::DialogPropertiesTask_TabAlgorythm::~DialogPropertiesTask_TabAlgorythm() {
}

