// ********************************************************************************************************************
// *                                                                                                                  *
// *  Class for control left-aileron deflection. Based on array because it controls all existing ailerons togehter.   *
// * ---------------------------------------------------------------------------------------------------------------- *
// *  Класс для управления отклонением левого элерона. Основан на массиве, потому что управляет всеми существующими   *
// *                                            у модели элеронами одновременно.                                      *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 08 may 2017 at 17:32 *
// ********************************************************************************************************************

#include "XChLeftAileron.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                    The constructor.                                              *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Конструктор.                                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::XChLeftAileron::XChLeftAileron() 
    : XChFloatArray ( "LeftAileron", "sim/flightmodel/controls/ail1_def", -60, 60 )
{
    // Indexes for left aileron. The minus sign due to the configuration, we want the negative values to deflect the aileron down.
    // Индексы для левого элерона. Знак минуса - из-за конфигурации, мы хотим, чтобы отрицательные значения отклоняли элерон вниз.
    
    _templateArray[8] = -1;        
    _templateArray[25] = -1;
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                  The destructor.                                                 *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                     Деструктор.                                                  *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::XChLeftAileron::~XChLeftAileron() {

}


