// ********************************************************************************************************************
// *                                                                                                                  *
// *                      Class for control left flaperon (or flap, this is depending on plane construction).         *
// * ---------------------------------------------------------------------------------------------------------------- *
// *        Класс для управления отклонением левого флаперона (или закрылка, это зависит от конструкции самолета )    *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 10 may 2017 at 11:25 *
// ********************************************************************************************************************

#include "XChLeftFlaperon.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                    The constructor.                                              *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Конструктор.                                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::XChLeftFlaperon::XChLeftFlaperon() 
    : XChFloatArray("LeftFlaperon", "sim/flightmodel/controls/fla1_def", -60, 60 ) {
        
    // Indexes for left flaperon. The minus sign due to the configuration, we want the negative values to deflect the aileron down.
    // Индексы для левого флаперона. Знак минуса - из-за конфигурации, мы хотим, чтобы отрицательные значения отклоняли элерон вниз.
    
    _templateArray[ 8 ] = -1;        
    _templateArray[ 25 ] = -1;
};

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The desctructor.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Деструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::XChLeftFlaperon::~XChLeftFlaperon() {

}

