// ********************************************************************************************************************
// *                                                                                                                  *
// *                     Class for control right flaperon (or flap, this is depending on plane construction).         *
// * ---------------------------------------------------------------------------------------------------------------- *
// *       Класс для управления отклонением правого флаперона (или закрылка, это зависит от конструкции самолета )    *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 10 may 2017 at 11:26 *
// ********************************************************************************************************************

#include "XChRightFlaperon.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The constructor.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                     Конструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::XChRightFlaperon::XChRightFlaperon() 
    : XChFloatArray ( "RightFlaperon" , "sim/flightmodel/controls/fla1_def" , -60 , 60 )
{
    // Indexes for left flaperon. The minus sign due to the configuration, we want the negative values to deflect the aileron down.
    // Индексы для левого флаперона. Знак минуса - из-за конфигурации, мы хотим, чтобы отрицательные значения отклоняли элерон вниз.
    
    _templateArray[ 9 ] = -1;        
    _templateArray[ 24 ] = -1;
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The desctructor.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                       Деструктор.                                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::XChRightFlaperon::~XChRightFlaperon() {

}

