// ********************************************************************************************************************
// *                                                                                                                  *
// *                   External settings for X-Plane plugin to use it together with another software                  *
// * ---------------------------------------------------------------------------------------------------------------- *
// *      Внешние установки плагина X-Plane для его совместного использования с другим программным обеспечением.      *
// *                                                                                                                  *
// ********************************************************************************************************************

#pragma once

// Last external programs activity time (the path in in the redis) to take a control for user aircraft.
// Последнее время активности внешних программ (путь в редисе) для перехвата управления пользовательским самолетом.

#define USER_AIRCRAFT_CONTROL_PING_PATH "xtengu.control_presence.0"
