// ********************************************************************************************************************
// *                                                                                                                  *
// *                               The graphics representation of tengu.core.Task class                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                 Графическое представление класса tengu.core.Task                                 *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 09 jun 2017 at 10:58 *
// ********************************************************************************************************************

#include "TaskItem.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The constructor.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                     Конструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::TaskItem::TaskItem ( tengu::Task * task, QGraphicsItem * parent ) 
    : AbstractAgentItem ( task , parent )
{
    _boundRect = QRectF( 0.0, 0.0, 192.0, 64.0 );
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                           The bounding rectangle for this task.                                  *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                          Связанный с этой задачей прямоугольник.                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

/*
QRectF tengu::TaskItem::boundingRect() const {
    return 
}
*/

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                  The paint method.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                   Метод отрисовки.                                               *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::TaskItem::paint ( QPainter * painter, const QStyleOptionGraphicsItem * option, QWidget * widget ) {
    
    // Remember the old settings of the painter for later restore it.
    // Запоминаем старые установки рисователя для последующего его восстановления.
    
    QPen oldPen = painter->pen();
    QFont oldFont = painter->font();
    
    // The color of filling.
    // Цвет заливки.
    
    QPen fillPen;
    fillPen.setColor( QColor( 242,187, 136 ) );
    painter->setPen( fillPen );
    painter->fillRect( _boundRect, QColor(242,187,136)  );
    
    // Цвет бордюра.
    QPen borderPen;
    borderPen.setStyle( Qt::SolidLine );
    borderPen.setWidth( 3 );
    borderPen.setColor( QColor( 128, 63, 0) );
    painter->setPen( borderPen );
    // Рисуем рамку.    
    painter->drawRect( _boundRect );
    
    // Рисуем текст.
    QFont font;
    font.setBold( true );
    font.setPixelSize( 16 );
    font.setFamily("Tahoma");
    painter->setFont( font );
    painter->drawText( 20, 20, __task()->systemName() );
        
    // Восстановление старого состояния "рисователя".
    painter->setPen( oldPen );
    painter->setFont( oldFont );
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                          Get pointer to the represented task.                                    *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                      Получить указатель на представляемую задачу.                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::Task * tengu::TaskItem::__task() {
    return ( Task * ) _agent;
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The destructor.                                                *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Деструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::TaskItem::~TaskItem() {

}


