// ********************************************************************************************************************
// *                                                                                                                  *
// *      The abstract agent. Any logical completed piece which can do something. Usually it is a separate process    *
// *                                              inside operation system.                                            *
// * ---------------------------------------------------------------------------------------------------------------- *
// *    Абстрактный агент. Любой логически законченный кусок, который может что-то делать. Как правило - отдельный    *
// *                                             процесс операционной системы.                                        *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 26 may 2017 at 11:59 *
// ********************************************************************************************************************

#include "AbstractAgent.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                    The constructor.                                              *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Конструктор.                                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::AbstractAgent::AbstractAgent ( AbstractAgentKernel * parent, QString name ) 
    : AbstractAgentKernel ( parent, name ) 
{    
    _activityChannel = QString("");

    // Additional reaction for subscriber
    if ( _sub_redis ) {
        
        QObject::connect( _sub_redis, SIGNAL( signalConnected() ), this, SLOT( __on_subscriber_connected() ) );
        QObject::connect( _sub_redis, SIGNAL( signalSubscribed( QString ) ), this, SLOT( __on_subscribed( QString ) ) );
        QObject::connect( _sub_redis, SIGNAL( signalUnsubscribed( QString ) ), this, SLOT( __on_unsubscribed( QString ) ) );
        QObject::connect( _sub_redis, SIGNAL( signalGotMessage( QString, QString ) ), this, SLOT( __on_got_message( QString, QString ) ) );
    };    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                           Subscriber redis has been connected.                                   *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                              Редис-подписчик - соединился.                                       *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::AbstractAgent::__on_subscriber_connected() {
    __subscribe();
};

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                      We has been subscribed to someone channel.                                  *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                          Мы подписались на какой-то канал.                                       *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::AbstractAgent::__on_subscribed ( QString channel ) {
    
    foreach ( Sprout * sprout, __sprouts ) {
        sprout->subscribed( channel );
    };
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                   We has been unsubscribed from someone channel.                                 *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                         Нас отписали от какого-то канала.                                        *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::AbstractAgent::__on_unsubscribed ( QString channel ) {
    
    foreach ( Sprout * sprout, __sprouts ) {
        sprout->unsubscribed( channel );
    };
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                     We got some message from subscriber redis.                                   *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                    Мы получили сообщение от редиса по подписке.                                  *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::AbstractAgent::__on_got_message ( QString channel, QString message ) {
    
    bool handled = false;
    
    foreach ( Sprout * sprout, __sprouts ) {
        bool res = sprout->handleMessage( channel, message );
        if ( res ) handled = true;
    }    
    
    if ( ! handled ) {
        qDebug() << "AbstractAgent::__on_got_message(" << channel << ") was not handled.";
    }
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                           Got message from activity channel.                                     *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                        Получено сообщение из канала активности.                                  *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::AbstractAgent::__on_activity_channel_message ( QVariant value ) {
    
    bool ok = false;
    QString msg = value.toString();
    int i = msg.toInt( & ok );
    if ( ( ok ) && ( i != 0 ) ) _setActivity( true );
    else if ( msg.toUpper() == "TRUE" ) _setActivity( true );
    else _setActivity( value.toBool() );
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                           Subscribe all existing sprouts.                                        *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                            Подписать всех имеющихся реакторов ("веточки" данного агента).                        *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::AbstractAgent::__subscribe() {
    
    foreach ( Sprout * sprout, __sprouts) {
        sprout->subscribe();
    };
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                               Add the reaction which will be handled (processed) .                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                         Добавить обрабатываемую реакцию.                                         *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::AbstractAgent::addSprout ( tengu::Sprout * sprout ) {
    __sprouts[ sprout->name() ] = sprout ;
    __subscribe();
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                Set activity channel                                              *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                             Установка канала активности.                                         *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::AbstractAgent::setActivityChannel ( QString activityChannel ) {
    
    if ( ! activityChannel.isEmpty() ) {
        _activityChannel = activityChannel;
        Sprout * aSprout = new Sprout( this, "Activity" );
        aSprout->setInputChannel( activityChannel );
        QObject::connect( aSprout, SIGNAL( signalGotValue( QVariant ) ), this, SLOT( __on_activity_channel_message( QVariant ) ) );
        addSprout( aSprout );
    };
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                    The destructor.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                       Деструктор.                                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::AbstractAgent::~AbstractAgent() {
    
}


