// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                 The MongoDB index class.                                         *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                  Класс MongoDB индекса.                                          *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 08 jul 2017 at 12:32 *
// ********************************************************************************************************************

#include "MongoIndex.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                    The constructor.                                              *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                       Конструктор.                                               *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::MongoIndex::MongoIndex() {
    name = QString("");
    background = true;
    unique = false;
    key = QList<one_key_t>();
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                             Conversion from object to JSON.                                      *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                            Преобразование из объекта в JSON.                                     *
// *                                                                                                                  *
// ********************************************************************************************************************

QJsonObject tengu::MongoIndex::toJSON() {

    QJsonObject o;
    
    o["name"] = name;
    QJsonArray arr;
    for ( int i=0; i<key.size(); i++ ) {
        one_key_t ok = key.at(i);
        QJsonObject okjo ;
        okjo[ ok.name ] = ok.asc;
        arr.append( okjo );
    };
    o["key"] = arr; 
    o["background"] = background;
    o["unique"] = unique;
    
    return o;
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                             Form one key struct from JSON.                                       *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                       Сформировать одну структуру ключа из JSON'а.                               *
// *                                                                                                                  *
// ********************************************************************************************************************

bool tengu::MongoIndex::__getOneKey( QJsonObject o, struct one_key_t & k ) {

    if ( o.keys().count() != 1 ) {
        qDebug() << "MongoIndex::__getOneKey, got more than one key: " << o;
        return false;
        
    } else {
        
        QString hisKey = o.keys().at(0);
        int hisVal = o[ hisKey ].toInt();
        k.name = hisKey;
        k.asc = hisVal;
        return true;
    };
};

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                              Conversion from JSON to object                                      *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                             Преобразование из JSONа в объект.                                    *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::MongoIndex::fromJSON( QJsonObject o ) {
    
    if ( o.contains("name") ) name=o.value("name").toString();
    if ( o.contains("background") ) background = o.value("background").toBool();
    if ( o.contains("unique") ) unique = o.value("unique").toBool();
    
    if ( o.contains("key") && ( ( o["key"].isArray() ) || ( o["key"].isObject() ) ) ) {
        
        if ( o["key"].isObject() ) {
            struct one_key_t curKey; 
            if ( __getOneKey( o["key"].toObject(), curKey ) ) key.append( curKey );
        };
        
        if ( o["key"].isArray() ) {
            QJsonArray arr = o["key"].toArray();
            for ( int i=0; i<arr.size(); i++ ) {
                struct one_key_t curKey;
                if ( __getOneKey( arr.at(i).toObject(), curKey ) ) key.append( curKey ); 
            };
        };
                
    };
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                     The destructor.                                              *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                       Деструктор.                                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::MongoIndex::~MongoIndex() {
}

