// ********************************************************************************************************************
// *                                                                                                                  *
// *          The process. A container for tasks. It have a start point and stop('s) point(-s), it execute            *
// *                                                 by focus transition.                                             *
// * ---------------------------------------------------------------------------------------------------------------- *
// *         Процесс (контейнер для задач). Имеет точку старта и одну или несколько точек останова. Выполняется       *
// *                                                путем перехода фокуса.                                            *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 09 jun 2017 at 10:33 *
// ********************************************************************************************************************

#include "Process.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                  The constructor.                                                *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                     Конструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::Process::Process () 
    : AbstractAgentKernel ()
{

}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                              The copying constructor.                                            *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                               Конструктор копирования.                                           *
// *                                                                                                                  *
// ********************************************************************************************************************
/*
tengu::Process::Process ( const tengu::Process & o ) 
    : Process()
{

}
*/

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                    Overrided function for add a child to this process.                           *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                    Перекрытая функция добавления дитя в данный процесс.                          *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::Process::addChild ( tengu::AbstractAgentKernel* child ) {
    
    tengu::AbstractAgentKernel::addChild ( child );
    
    QList<AbstractAgentKernel * > hisChildren = children();
    
    Task * task = dynamic_cast<Task*> ( child );
    if ( task ) {
        int taskCount = 0;
        for ( int i=0; i<hisChildren.count(); i++ ) {
            Task * t = dynamic_cast<Task * > ( hisChildren.at(i) );
            if ( t ) taskCount ++;
        };
        if ( child->getSystemName().isEmpty() ) child->setSystemName( tr("New_Task_") + QString::number( taskCount ) );
        if ( child->getHumanName().isEmpty() ) child->setHumanName( tr("New Task ") + QString::number( taskCount ) );
    };
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The destructor.                                                *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Деструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::Process::~Process() {
    
}
