// ********************************************************************************************************************
// *                                                                                                                  *
// *                                          Table MVC-model for agent's properties.                                 *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                          Табличная MVC-модель для свойств агента.                                *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 01 jun 2017 at 11:35 *
// ********************************************************************************************************************

#include "AgentPropertyModel.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The constructor.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Конструктор.                                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::AgentPropertyModel::AgentPropertyModel()
    : QAbstractItemModel()
{
    __item = nullptr;
    __properties = QList<QPair<QString, QVariant>>();
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                      Return the column count for this MVC-model.                                 *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                     Вернуть число столбцов для данной MVC-модели.                                *
// *                                                                                                                  *
// ********************************************************************************************************************

int tengu::AgentPropertyModel::columnCount(const QModelIndex & parent ) const {
    return 2;
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                      Return the row count for this model element.                                *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                    Вернуть число строк для данного элемента модели.                              *
// *                                                                                                                  *
// ********************************************************************************************************************

int tengu::AgentPropertyModel::rowCount( const QModelIndex & parent ) const {
    return __properties.count();
};

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                    Return model index for specivied element                                      *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                 Вернуть индекс в модели для указанного элемента.                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

QModelIndex tengu::AgentPropertyModel::index(int row, int column, const QModelIndex & parent ) const {

    QModelIndex res = createIndex( row, column );
    return res;
};

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                          Get a parent for the child.                                             *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                      Вернуть родителя для данного дитяти.                                        *
// *                                                                                                                  *
// ********************************************************************************************************************

QModelIndex tengu::AgentPropertyModel::parent( const QModelIndex & child ) const {

    QModelIndex res;
    return res;
};

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                            Make flags for this index.                                            *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                            Флаги для данного индекса.                                            *
// *                                                                                                                  *
// ********************************************************************************************************************

Qt::ItemFlags tengu::AgentPropertyModel::flags(const QModelIndex & index) const {
    
    qDebug() << "Get flags...";
    
    Qt::ItemFlags defaultFlags = Qt::ItemIsEnabled | Qt::ItemNeverHasChildren;
    
    if ( !index.isValid() ) return defaultFlags;
    
    // At least the index is valid.
    // Как минимум, индекс - вменяемый.
    
    if ( index.row() == 0 ) {
        
        // First row never editable.
        // Первый столбец не редактируется/
        
        return defaultFlags;
        
    };
    
    // UUID field is never editable.
    
    if ( index.column() == 0 ) return defaultFlags;
    
    // All another fields is editable.
    // Все остальные поля можно редактировать.
    
    return QAbstractItemModel::flags( index ) | Qt::ItemIsEditable | defaultFlags;
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                        Return data for this model index.                                         *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                         Вернуть данные для этого индекса.                                        *
// *                                                                                                                  *
// ********************************************************************************************************************

QVariant tengu::AgentPropertyModel::data( const QModelIndex & index, int role ) const {
    
    qDebug() << "Get data...";
    
    if ( ! index.isValid() ) return QVariant();
    
    if ( ( role == Qt::DisplayRole ) || ( role == Qt::EditRole ) ) {
    
        // Want to display. Return contents of properties list.
        // Хотим показываать. Возвращаем содержание списка свойств.
        
        QVariant answer;
        
        if ( index.row() < __properties.size() ) {
            if ( index.column() == 0 ) answer = QVariant( __properties.at( index.row() ).first );
            else answer = __properties.at( index.row() ).second;
        };
        
        return answer;
    };
    
    qDebug() << "get data, but not for display. Role=" << role;
    
    return QVariant();
    
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                          Edit data for specified index                                           *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                  Редактирование данных для указанного индекса.                                   *
// *                                                                                                                  *
// ********************************************************************************************************************

bool tengu::AgentPropertyModel::setData(const QModelIndex & index, const QVariant & value, int role) {
    
    qDebug() << "set data row=" << index.row() << ", value=" << value << ", role=" << role;
    
    if (index.isValid() && role == Qt::EditRole) {
        /*
        stringList.replace(index.row(), value.toString());
        emit dataChanged(index, index);
        */
        return true;        
    }
    return false;
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                          Set appropriate agent for data model.                                   *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                  Установка соответствующего агента для модели данных.                            *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::AgentPropertyModel::setEntityItem ( tengu::AbstractEntityItem * item ) {

    qDebug() << "Set agent item, item=" << item;
    __item = item;
    qDebug() << "Try to get item properties...";
    __properties = item->properties();    
    qDebug() << "After agent properties size=" << __properties.size();
    emit layoutChanged();
    
}


// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                    The destructor.                                               *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                       Деструктор.                                                *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::AgentPropertyModel::~AgentPropertyModel() {
}


