// ********************************************************************************************************************
// *                                                                                                                  *
// *                         One button at component library toolbar, it can emit drag event.                         *
// * ---------------------------------------------------------------------------------------------------------------- *
// *             Кнопка на тулбаре библиотеки компонентов, которая может генерировать сигнал перетаскивания.          *
// *                                                                                                                  *
// * Eugene G. Sysoletin <e.g.sysoletin@gmail.com>                                       Created 12 jun 2017 at 16:13 *
// ********************************************************************************************************************

#include "LibraryTab_Button.h"

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                  The constructor.                                                *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                    Конструктор.                                                  *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::LibraryTab_Button::LibraryTab_Button ( QIcon icon, QString hint ) 
    : QPushButton()
{
    __mouse_left_button_pressed = false;
    setFlat( true );
    setIcon( icon );
    setToolTip( hint );
    setFixedSize( QSize( 22, 22 ) );
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                              Mouse press event handler.                                          *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                           Обработчик события нажатия мыши.                                       *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::LibraryTab_Button::mousePressEvent ( QMouseEvent * event ) {
    
    QAbstractButton::mousePressEvent ( event );
    
    if ( event->buttons() | Qt::LeftButton ) {
        __mouse_left_button_pressed = true;
        __mouse_pressed_position = event->pos();
    }
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                               Mouse move event handler.                                          *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                          Обработчик события перемещения мыши.                                    *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::LibraryTab_Button::mouseMoveEvent ( QMouseEvent* event ) {
    
    QAbstractButton::mouseMoveEvent ( event );
    
    if ( __mouse_left_button_pressed ) {
        QPoint pos = event->pos();
    };
}

// ********************************************************************************************************************
// *                                                                                                                  *
// *                                              Mouse release event handler.                                        *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                          Обработчик события отпускания мыши.                                     *
// *                                                                                                                  *
// ********************************************************************************************************************

void tengu::LibraryTab_Button::mouseReleaseEvent ( QMouseEvent* event ) {
    
    QAbstractButton::mouseReleaseEvent ( event );
    
    if ( event->buttons() | Qt::LeftButton ) {
        __mouse_left_button_pressed = false;
    };
}


// ********************************************************************************************************************
// *                                                                                                                  *
// *                                                   The destructor.                                                *
// * ---------------------------------------------------------------------------------------------------------------- *
// *                                                      Деструктор.                                                 *
// *                                                                                                                  *
// ********************************************************************************************************************

tengu::LibraryTab_Button::~LibraryTab_Button() {

}
